## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/14bf1be2-1418-4262-acfb-3c7f49629786).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpz51n5t3d/plan`

```diff
2024-12-02T20:07:38.129Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T20:07:38.130Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T20:07:38.130Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T20:07:38.130Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T20:07:38.130Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T20:07:38.130Z [INFO]  Go runtime version: go1.21.11
2024-12-02T20:07:38.130Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpz51n5t3d/plan"}
2024-12-02T20:07:38.130Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T20:07:38.130Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T20:07:38.130Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T20:07:38.130Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T20:07:38.130Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T20:07:38.130Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T20:07:38.130Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T20:07:38.130Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T20:07:38.130Z [INFO]  CLI command args: []string{"show", "/tmp/tmpz51n5t3d/plan"}
2024-12-02T20:07:38.223Z [DEBUG] checking for provisioner in "."
2024-12-02T20:07:38.223Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T20:07:38.223Z [DEBUG] created provider logger: level=debug
2024-12-02T20:07:38.224Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:07:38.238Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T20:07:38.239Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=316
2024-12-02T20:07:38.239Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T20:07:38.250Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T20:07:38.250Z
2024-12-02T20:07:38.265Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin4034521599 network=unix timestamp=2024-12-02T20:07:38.265Z
2024-12-02T20:07:38.265Z [DEBUG] provider: using plugin: version=6
2024-12-02T20:07:38.299Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:07:38.301Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=316
2024-12-02T20:07:38.301Z [DEBUG] provider: plugin exited
2024-12-02T20:07:38.301Z [DEBUG] created provider logger: level=debug
2024-12-02T20:07:38.301Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:07:38.307Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T20:07:38.307Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=325
2024-12-02T20:07:38.307Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T20:07:38.310Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T20:07:38.310Z
2024-12-02T20:07:38.326Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:07:38.326Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin2075021488 network=unix timestamp=2024-12-02T20:07:38.325Z
2024-12-02T20:07:38.337Z [DEBUG] No provider meta schema returned
2024-12-02T20:07:38.337Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:07:38.338Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=325
2024-12-02T20:07:38.338Z [DEBUG] provider: plugin exited
2024-12-02T20:07:38.338Z [DEBUG] created provider logger: level=debug
2024-12-02T20:07:38.338Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:07:38.344Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T20:07:38.344Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=334
2024-12-02T20:07:38.344Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T20:07:38.394Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T20:07:38.394Z
2024-12-02T20:07:38.413Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin3163086018 network=unix timestamp=2024-12-02T20:07:38.413Z
2024-12-02T20:07:38.413Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:07:38.432Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94U[lWf\xf6b\xaf/\xfb{m\xaf\xafo㓤Yo\xe3ﱝĥ\xadҺ\x91J\x90\x85\xf3\x80\xa8*3\x99=^\x8f2;\xb3:3\xbb\x8e\xdf\xf6\xa1TAB\x80\xbcp\x89(B(MQ\xaa@PQ\x80T)$\x9a
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa9E\x88JU\xa1\xad"A#⇠3\xb377[\xa7\xb5dk=\xdf\xe5\xbfο\xc7y\xeb\xda7\xaf\xfd\xe0o\xcfa"F\x88$b$
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xb1\xd5\xf3o\xec\xac9\xf8\xf8\x95څ\xb7b\x88\x82\xfc\xd7\xa24N8%G\x88q\x8c\xab]4M"x\xf67ף4F" h\x9cD\xe1\xb60"Ѝ\xdd*\xc9\x85\xecQH\xff\xfd\xeeu\xe9\x83\x9fFVz\xb17\xc0b\xf8ܯ\xfe$\xb18|G	\xb08\xf4a\x9f\xdaO\x81\xc4\xf1\xdc;7$\xd6_u]0\x80j\x92\xa6I\xfe\xfe7d\xfcn '\xde\xd5\xdd \xea`\x8e)L\xa9I\x9a$\xdd\xf8\xe2\xab\xb7\x9c Dᐚ\xa4@~\xf0\xe1\xbb2D^\xec\xb0\xe3\xb0:B\x93\xa4/\xbc\xf1|\x9c\xc6H/\xe4\xa8ҘVG)\x90\xbe|\xe9\xc7q'}p1̬Q\xa3@z\xf1\x95\xbd \xb1~\xb8b\xfd\x90\xc1\x8c:N\x81\xf4\xe1\xe5+\x97$6 /\x85\xf9\xc0N\xa8\x934I\xfa񅋗d\xb8$T\x83pI\x98© \xc0w.\xdc\xea\xa71\x90
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1:  \x80i\x9cVU
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: $\x89o|#B\xe3d\x830\x833*M!( \x99H*\x91h,\xde\xd5Mz\xbd}\xfd\xb2l\xc0\xff\xa9O\xf6\xcd(4M\xf1\xfc/\xae\xcb~\x86\xf3L\xc1+\xa1[
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xf6\xe1\xbe`R)|\xb31şD@\xa1I2\x84\xe7^{[j\x86\xa0\xa45\xfbq\xbfz\x80\xa6\xc90^9{GBð\x8f\xc6\xc9\xfc=l\xc50<\x80\xa8r\x84\x8c\xc0A<\xa8f)\x90\xfc\xda\xed\xff\xc9\xa4\xe1|\xc8J\xc3,\xceXw\x8d\xbe%\x95n\xd5\x83\xa9\xd8\xd0\xf0H\xbaQ\xd2(\xde|\xad^ҳ2\xbd4A|\xfdJ[IQ\xb8\xa9\x80B\x81\x8c\xe1\xd7\xffY_G\x8f\xc9\xe0o_\xba-3\x85\xc2E\x85\xe6\xd4i\x92\x8c㳯(+Ax4(\xe1
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa0	\xfc\xd9\xf9\xffJh\xd0\xccᜪQ \x93\xf8\xea\xefޓ\x8e\xb8\xd4`\xd0QW\xe7\xe9$\x99\xc2o?\xffv\x8c\xc6\xc98\xec$h\x9cL\xc0\xcd\x8d\x91I\xf0@\xbec\xe3\x90Ǽ:\x9f#d\xb2\xe0\xd3$,\xe0\x82\xbaH\x81L\xe3\xcbW\xefH\xf1|+\x9c\xd0,\xe1\x92z\x98Q\xf1\xd7o}Wn\xd74\xectA\xa7\xe1Q\x8fR 3\xf8\xf3\xbf\x98
2024-12-02T20:07:38.596Z [DEBUG] provider.terraform-provider-akash_v0.1.1: 1\x96q9\xc0(^\xfbK\x80\xcd\xc0\xd5\x9b\x81\x87\xf0!\xf5hj\xac\xd1n\xc51\xb9C\x99\xf1\x89ɩiu\x86f\x80(P\xab\xd5"X\xbbz\xab?\xfb٣Jf\x98D\xa0v\xf5\xee\xf7޿;\x8d\xb5Z\xed\xfb\xefߝ\xce>\x9cɐ\xa8\xe4\xedܕ?
2024-12-02T20:07:38.598Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xd6~\xd8\xf8\x98}\x84}\x86u{F\xa9ls\x8f\xc5M\xb7\xe2\xf8,j\x96+\xac\xd71\xd7\xe3\xa6\xeb<v\xc0\xdbe\xdfչm[e\xdf2u\xcb\xf1\xb9p[߰_+/\xb1\xfc\x89\x8a\xcd\x99{\xd1\xf4\xf2˯K\xc1\xe1E\xad\xe8\xb2ys/\xb6\x96ͭ.\xb1\xfc\x936/qǟդ\xff\xdei\xfe\xd2x\xe1c\x8d\xcb\xf3\xb9Y\xb7^u-i\xfc\x84[9esv\xf0>\xa2\xa6\xfb\x91\xfbw\xbb\xaf\x99\x86m\x88\xdbgُ5ُ\x95\x8a\xa8\xf2:\xebq\xc3\xe3s\xf4#\xccfll f\xc134\xcf*:\x9f\xe3\x96\xc9F\xda=ċ.l\xd8x\xfb\xa3\x90\xb9W\xba\x97\xbff6\xddΗ\xc5	\xabj\xf8\xfc)\xbe=&\xeb\x843K\xf3\xcbڊ\xe0\x86\xcfW\xb8\xf0\xad\xcb4|Ά\xda\xe0\x90StكE\xcb߬\x9c\xd2L\xb7\xa4oަe\xba\xa2\xacݹ\xb2])Z\x8eV\xe4Fh\xc4\xe6\xf6&\xab\xe6\xb5EmQ/\xf9\xb6'\xbd\xf7\xefM\xd7ָ\xa8r\xa6\xef\xcdj\x98z\x92,\xa4\xed\xe3>\xc2\xd8pE\xa9\x9e\xf9\\xd1\xd5\xfd\x8d\xb2p}\xb7\xba\xa4\xfbKu\x830\xe8\x89O\xeaq\xac:\xaf-k\xf9NV\x9f>%\xafpZ\xaf2\xbd\xde\xdafNaJO|\xb2\x94B\x8fcU\xa6\xe5\x8fh\xf3u\xaf0ٜ\xe5O\xe3RW\xd7{\xd2S2,G\x93\x98\xda\xd6M\xe1V\xads\xc6i\xc3\xdb\xd4%,\xe3\xf4\x89\x8a\xe3[%\xf2\x93\xf5\xff\xf4\xb2pM	\xfcI\xe9\xf4\xe6?V(\xec^޲!<\xfe\xe4Jk\xc3w/\xaf\xc7\xcd\xe0\xbe\xecZ\xf8\xd5{4\x99\xfa\xc2\xcbu\xdb\xfc\xef\xa3o{\xf2W\xe6\x9cn\xa3ii~\xf9)\xbe\xbdjX\x82=\xd2\xf6<\x9b\xd7\xe8\xb8\xe1\xbcM\xe34_\xf3\x9f\x9f\xfc\xfcZ~aV\xf3\xb8Sf)\xda_\xbb\xfd-\xb9\xbeِ\xad\x876\xeb\xbe\xed\xe5\xb4\xa2\xcb\xf2-\xd6\xdeA\x9a\x8c\xb8\x8e#SU\xdeʎM\xb58\xf7\x97a\xf7\xb5p-[\xf7hFXq\x9f\x9f\xf1Y\xaaE\xd2M\xd7	\xe6\xdfI\xd8lJC8\xd16ݛ$\xf6h\xd1u\x8b\xb6\xdcZ\xdbp\x8a\x9a+\x8azQ\x94M\xdd\xbc\xc0\xdf2l\xa9\xf2moE\xf0\x827ni[m\xf9\xce\xfa\xe0`\xd5\xe6\xdb}#~\xb8\xb3\xa4\xf5-\xea\xc3\xf1ʮ\xf0\xb5/\xf0\xadp\x96'\x8f\xd8c\x9d\xd5̀V㻸\xe9\xa2o\xfa~\x99Շ-\xfb\xcd:[h\xd9\lVs\xf8\xd6\xf1\x93'WY+l\xb6\xb3\xa66\%\xe9\xaeuf\xb6\xb9\xcb\xd9\xda\xfc\x8bƖ\v\xe8\xbe\xfc +m\xa3\xe2\x98\xec\xacR?\xd5\xfa\x96+N{e\xc3\xe4\xbamls!\xb7Bp]ky\x82\xa3\xe1\xe9\x82-\xcf\xdb-P\xb3\ݮ\x94\xf8?\xa5\x877e^\xcbkyݶ\x9cʙu\xa3T8\xbc\xd8~\xccw\x9d\x9f\xf5j\xc0e]OW\x9e\xfbK<]\xf5\xb6=Ӱ\xedg\xfe  \xff\xff$\x95\xc6\xc8  
2024-12-02T20:07:38.598Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=334
2024-12-02T20:07:38.598Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
